; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	thermograph2 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	infrared4 - mode
	infrared3 - mode
	GroundStation2 - direction
	Star3 - direction
	Star1 - direction
	Star0 - direction
	Star4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared4)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared4)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet17)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star1)
	(supports instrument6 spectrograph1)
	(supports instrument6 infrared4)
	(calibration_target instrument6 Star4)
	(supports instrument7 spectrograph1)
	(supports instrument7 infrared3)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 Star0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument8 infrared3)
	(supports instrument8 spectrograph0)
	(supports instrument8 infrared4)
	(calibration_target instrument8 Star0)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument9 infrared3)
	(supports instrument9 infrared4)
	(calibration_target instrument9 Star4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet14)
)
(:goal (and
	(pointing satellite4 Star1)
	(have_image Planet5 infrared4)
	(have_image Phenomenon6 spectrograph1)
	(have_image Phenomenon7 infrared3)
	(have_image Star8 infrared4)
	(have_image Star9 spectrograph0)
	(have_image Planet10 thermograph2)
	(have_image Star11 infrared3)
	(have_image Planet12 infrared3)
	(have_image Planet13 infrared3)
	(have_image Planet14 spectrograph1)
	(have_image Star16 infrared3)
	(have_image Planet17 infrared4)
))

)

; plan
1. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 0 of 13
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 13
3. (calibrate satellite3 instrument8 star0)
   added: (calibrated instrument8)
   goals met: 0 of 13
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
5. (turn_to satellite4 star1 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 star1)
   goals met: 1 of 13
6. (turn_to satellite3 phenomenon7 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 phenomenon7)
   goals met: 1 of 13
7. (take_image satellite3 phenomenon7 instrument8 infrared3)
   added: (have_image phenomenon7 infrared3)
   goals met: 2 of 13
8. (turn_to satellite3 planet12 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 planet12)
   goals met: 2 of 13
9. (take_image satellite3 planet12 instrument8 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 3 of 13
10. (turn_to satellite3 planet13 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 planet13)
   goals met: 3 of 13
11. (take_image satellite3 planet13 instrument8 infrared3)
   added: (have_image planet13 infrared3)
   goals met: 4 of 13
12. (turn_to satellite3 planet17 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 planet17)
   goals met: 4 of 13
13. (take_image satellite3 planet17 instrument8 infrared4)
   added: (have_image planet17 infrared4)
   goals met: 5 of 13
14. (turn_to satellite3 planet5 planet17)
   deleted: (pointing satellite3 planet17)
   added: (pointing satellite3 planet5)
   goals met: 5 of 13
15. (take_image satellite3 planet5 instrument8 infrared4)
   added: (have_image planet5 infrared4)
   goals met: 6 of 13
16. (turn_to satellite3 star11 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 star11)
   goals met: 6 of 13
17. (take_image satellite3 star11 instrument8 infrared3)
   added: (have_image star11 infrared3)
   goals met: 7 of 13
18. (turn_to satellite3 star16 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star16)
   goals met: 7 of 13
19. (take_image satellite3 star16 instrument8 infrared3)
   added: (have_image star16 infrared3)
   goals met: 8 of 13
20. (turn_to satellite3 star8 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 star8)
   goals met: 8 of 13
21. (take_image satellite3 star8 instrument8 infrared4)
   added: (have_image star8 infrared4)
   goals met: 9 of 13
22. (turn_to satellite3 star9 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 star9)
   goals met: 9 of 13
23. (take_image satellite3 star9 instrument8 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 10 of 13
24. (turn_to satellite0 phenomenon6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon6)
   goals met: 10 of 13
25. (turn_to satellite0 star0 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star0)
   goals met: 10 of 13
26. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 10 of 13
27. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   goals met: 10 of 13
28. (take_image satellite0 phenomenon6 instrument0 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 11 of 13
29. (turn_to satellite0 planet10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet10)
   goals met: 11 of 13
30. (take_image satellite0 planet10 instrument0 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 12 of 13
31. (turn_to satellite0 planet14 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet14)
   goals met: 12 of 13
32. (take_image satellite0 planet14 instrument0 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 13 of 13
